Making a Machine Learning Model using the Bank Loan Case Study datasets to predict which future customer is a potential target.

A target is a loan applicant who is more likely to default on his repayments.
Thorough analysis of this dataset has been conducted to know which factors(variables) are proportional in deciding whether an applicant  is likely to default

In [1]:
import pandas as pd
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import mean_absolute_error
from sklearn.model_selection import train_test_split

In [2]:
import numpy as np
import matplotlib.pyplot as plt
import openpyxl

In [3]:
dataset = pd.read_csv("merged_data.csv")

C:\Users\91852\AppData\Local\Temp\ipykernel_16076\855236811.py:1: DtypeWarning: Columns (10,11) have mixed types. Specify dtype option on import or set low_memory=False.
  dataset = pd.read_csv("merged_data.csv")

In [34]:
dataset.columns

Index(['Unnamed: 0.1', 'Unnamed: 0', 'SK_ID_CURR', 'TARGET',
       'NAME_CONTRACT_TYPE_x', 'CODE_GENDER', 'FLAG_OWN_REALTY',
       'CNT_CHILDREN', 'AMT_INCOME_TOTAL', 'AMT_CREDIT_x', 'AMT_ANNUITY_x',
       'AMT_GOODS_PRICE_x', 'NAME_TYPE_SUITE', 'NAME_INCOME_TYPE',
       'NAME_EDUCATION_TYPE', 'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE',
       'REGION_POPULATION_RELATIVE', 'DAYS_BIRTH', 'DAYS_EMPLOYED',
       'DAYS_REGISTRATION', 'DAYS_ID_PUBLISH', 'FLAG_MOBIL', 'OCCUPATION_TYPE',
       'CNT_FAM_MEMBERS', 'REGION_RATING_CLIENT',
       'REGION_RATING_CLIENT_W_CITY', 'WEEKDAY_APPR_PROCESS_START',
       'HOUR_APPR_PROCESS_START', 'REG_REGION_NOT_LIVE_REGION',
       'REG_REGION_NOT_WORK_REGION', 'LIVE_REGION_NOT_WORK_REGION',
       'REG_CITY_NOT_LIVE_CITY', 'REG_CITY_NOT_WORK_CITY',
       'LIVE_CITY_NOT_WORK_CITY', 'ORGANIZATION_TYPE',
       'OBS_30_CNT_SOCIAL_CIRCLE', 'DEF_30_CNT_SOCIAL_CIRCLE',
       'OBS_60_CNT_SOCIAL_CIRCLE', 'DEF_60_CNT_SOCIAL_CIRCLE',
       'DAYS_LAST_PHONE_CHANGE', 'FLAG_DOCUMENT_3',
       'AMT_REQ_CREDIT_BUREAU_HOUR', 'AMT_REQ_CREDIT_BUREAU_DAY',
       'AMT_REQ_CREDIT_BUREAU_WEEK', 'AMT_REQ_CREDIT_BUREAU_MON',
       'AMT_REQ_CREDIT_BUREAU_QRT', 'AMT_REQ_CREDIT_BUREAU_YEAR', 'SK_ID_PREV',
       'NAME_CONTRACT_TYPE_y', 'AMT_ANNUITY_y', 'AMT_APPLICATION',
       'AMT_CREDIT_y', 'AMT_GOODS_PRICE_y', 'NAME_CASH_LOAN_PURPOSE',
       'NAME_CONTRACT_STATUS', 'DAYS_DECISION', 'NAME_PAYMENT_TYPE',
       'CODE_REJECT_REASON', 'NAME_CLIENT_TYPE', 'NAME_GOODS_CATEGORY',
       'NAME_PORTFOLIO', 'NAME_PRODUCT_TYPE', 'CHANNEL_TYPE',
       'SELLERPLACE_AREA', 'NAME_SELLER_INDUSTRY', 'CNT_PAYMENT',
       'NAME_YIELD_GROUP', 'PRODUCT_COMBINATION'],
      dtype='object')

In [4]:
y = dataset['TARGET']
cols = ['AMT_INCOME_TOTAL','REGION_RATING_CLIENT','NAME_EDUCATION_TYPE','NAME_TYPE_SUITE','NAME_INCOME_TYPE','CODE_GENDER','OCCUPATION_TYPE','AMT_CREDIT_x','CNT_CHILDREN','DAYS_EMPLOYED']
object_cols = ['NAME_EDUCATION_TYPE','NAME_TYPE_SUITE','NAME_INCOME_TYPE','CODE_GENDER','OCCUPATION_TYPE']
X = dataset[cols]
X.head()

,AMT_INCOME_TOTAL,REGION_RATING_CLIENT,NAME_EDUCATION_TYPE,NAME_TYPE_SUITE,NAME_INCOME_TYPE,CODE_GENDER,OCCUPATION_TYPE,AMT_CREDIT_x,CNT_CHILDREN,DAYS_EMPLOYED
0,202500.0,2,Secondary / secondary special,Unaccompanied,Working,M,Laborers,406597.5,0,637
1,270000.0,1,Higher education,Family,State servant,F,Core staff,1293502.5,0,1188
2,270000.0,1,Higher education,Family,State servant,F,Core staff,1293502.5,0,1188
3,270000.0,1,Higher education,Family,State servant,F,Core staff,1293502.5,0,1188
4,67500.0,2,Secondary / secondary special,Unaccompanied,Working,M,Laborers,135000.0,0,225

In [5]:
train_X, val_X, train_y, val_y = train_test_split(X, y, random_state=1)

Need to encode these categorical columns

In [6]:
from sklearn.preprocessing import OrdinalEncoder

In [7]:
label_X_train = train_X.copy()
label_X_valid = val_X.copy()
ordinal_encoder = OrdinalEncoder()
label_X_train[object_cols] = ordinal_encoder.fit_transform(train_X[object_cols])
label_X_valid[object_cols] = ordinal_encoder.transform(val_X[object_cols])

In [32]:
label_X_train.head()

,AMT_INCOME_TOTAL,REGION_RATING_CLIENT,NAME_EDUCATION_TYPE,NAME_TYPE_SUITE,NAME_INCOME_TYPE,CODE_GENDER,OCCUPATION_TYPE,AMT_CREDIT_x,CNT_CHILDREN,DAYS_EMPLOYED
630960,108000.0,2,2.0,6.0,6.0,0.0,1.0,490536.0,0,2078
288061,135000.0,2,1.0,6.0,6.0,1.0,8.0,855000.0,0,226
976711,270000.0,2,2.0,6.0,0.0,1.0,17.0,675000.0,0,951
525880,162000.0,2,1.0,6.0,6.0,1.0,8.0,270000.0,0,1698
1322978,360000.0,2,4.0,6.0,0.0,1.0,8.0,961146.0,0,3603

In [8]:
rf_model = RandomForestRegressor(random_state=1)
rf_model.fit(label_X_train, train_y)
rf_val_predictions = rf_model.predict(label_X_valid)

In [9]:
np.round_(rf_val_predictions[0:10],decimals=2)

array([0.01, 0.02, 0.07, 0.01, 0.86, 0.  , 0.  , 0.  , 1.  , 0.04])

In [ ]:
val_y.head(10)

996185     0
731549     0
1342829    0
1010577    0
375824     1
211730     0
367563     0
620360     0
748164     1
62441      0
Name: TARGET, dtype: int64

In [10]:
rf_val_mae = mean_absolute_error(rf_val_predictions, val_y)

print("Validation MAE for Random Forest Model: ",rf_val_mae)

Validation MAE for Random Forest Model:  0.02351262694378367